src/Documents/УстановкаИмениПользователя/УстановкаИмениПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаИмениПользователя</name>
  <registerRecords>InformationRegister.ИмяПользователяИID_В_TG</registerRecords>
  <tabularSections>
    <name>СписокПользователей</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.УчастникиОпросаTEST</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDПользователя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИмяПользователяИID_В_TG/ИмяПользователяИID_В_TG.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИмяПользователяИID_В_TG</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IDПользователя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.УчастникиОпросаTEST</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/УстановкаИмениПользователя/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокПользователейПользовательПриИзменении(Элемент)
	СтрокаТЧ = Элементы.СписокПользователей.ТекущиеДанные;  
	СтрокаТЧ.ИмяПользователя = ПолучитьАктуальноеИмяПользователя(СтрокаТЧ.Пользователь);
КонецПроцедуры

&НаСервере
Функция ПолучитьАктуальноеИмяПользователя(Пользователь)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИмяПользователяИID_В_TGСрезПоследних.ИмяПользователя КАК ИмяПользователя
		|ИЗ
		|	РегистрСведений.ИмяПользователяИID_В_TG.СрезПоследних(, Пользователь = &Пользователь) КАК ИмяПользователяИID_В_TGСрезПоследних";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ИмяПользователя;	
	КонецЦикла;
КонецФункции
